LABS_CONFIG = {
    "1": {
        "tests": {
            "baseform.py": [
                ["pub", 0.2, ["111", "2"], "1101111"],
                ["pub", 0.2, ["111", "4"], "1233"],
                ["pub", 0.2, ["111", "7"], "216"],
                ["***", 0.2, ["0", "9"], "0"],
                ["***", 0.2, ["1234", "6"], "5414"]],
            "cubic.py": [
                ["pub", 0.2, ["-6", "12", "-8"], "2.0 2.0 2.0"],
                ["pub", 0.2, ["0", "-2", "-4"], "2.0 (-1+1j) (-1-1j)"],
                ["pub", 0.2, ["3", "0", "-4"], "1.0 -2.0 -2.0"],
                ["***", 0.2, ["-1", "4", "-4"], "1.0 2j -2j"],
                ["***", 0.2, ["-12", "47", "-60"], "3.0 5.0 4.0"]],
            "dayofweek.py": [
                ["pub", 0.2, ["2025", "2", "28"], "Friday"],
                ["pub", 0.2, ["2025", "2", "29"], "Invalid date"],
                ["pub", 0.2, ["2015", "9", "1"], "Tuesday"],
                ["***", 0.2, ["2023", "13", "1"], "Invalid date"],
                ["***", 0.2, ["2022", "1", "32"], "Invalid date"]],
            "factors.py": [
                ["pub", 0.2, ["1024"], "2 2 2 2 2 2 2 2 2 2"],
                ["pub", 0.2, ["4471740"], "2 2 3 3 3 5 7 7 13 13"],
                ["pub", 0.2, ["19353563"], "19353563"],
                ["***", 0.2, ["137703491"], "7919 17389"],
                ["***", 5, ["2131872482737271273"], "23 1319 70273015879529"]],
            "gcd.py": [
                ["pub", 0.2, ["1000", "633"], "1"],
                ["pub", 0.2, ["384", "1024"], "128"],
                ["pub", 0.2, ["60", "60"], "60"],
                ["***", 0.2, ["51", "85"], "17"],
                ["***", 0.2, ["36", "0"], "36"]],
            "globedist.py": [
                ["pub", 0.2, ["53.90", "27.56", "53.88", "28.03"], "31"],
                ["pub", 0.2, ["55.75", "37.61", "40.71", "-74.00"], "7519"],
                ["pub", 0.2, ["0", "0", "0", "180"], "20038"],
                ["***", 0.2, ["-32.95", "-60.67", "33.32", "120.12"], "19953"],
                ["***", 0.2, ["38.65", "-9.14", "55.72", "37.73"], "3922"]],
            "goat.py": [
                ["pub", 0.2, ["5", "1"], "5.0"],
                ["pub", 0.2, ["10", "0.1"], "11.63496671566344"],
                ["pub", 0.2, ["10", "0.01"], "11.587309121050595"],
                ["***", 0.2, ["250", "0.1"], "289.68272802626484"],
                ["***", 0.2, ["360", "0.1"], "417.1431283578214"]],
            "palindrome.py": [
                ["pub", 0.2, ["12321"], "True"],
                ["pub", 0.2, ["6776"], "True"],
                ["pub", 0.2, ["123456789"], "False"],
                ["***", 0.2, ["9876543210123456789"], "True"],
                ["***", 0.2, ["3"], "True"]]
        },
        "filenames": ["baseform.py", "cubic.py", "dayofweek.py", "factors.py", "gcd.py", "globedist.py", "goat.py", "palindrome.py"],
        "modules": ["sys", "math"],
        "args": []
    },
    "2": {
        "tests": {
            "anomaly.py": [
                ["pub", 0.2, ["8,9,1,7,8,5,8,9,7,3,4,8,8,9,7,4,6,8", "1"], "[9, 1, 9, 3, 4, 9, 4]"],
                ["pub", 0.2, ["8,9,1,7,8,5,8,9,7,3,4,8,8,9,7,4,6,8", "2"], "[1]"],
                ["pub", 0.2, ["8,9,1,7,8,5,8,9,7,3,4,8,8,9,7,4,6,8", "3"], "[]"],
                ["***", 0.2, ["4,7,6,48,12,15,3,20,20,2,50", "1"], "[48, 50]"],
                ["***", 0.2, ["1,2,3,4,5,6,7,8,9,18,27,36", "2"], "[36]"]],
            "gauss.py": [
                ["pub", 0.2, [], "Invalid input"],
                ["pub", 0.2, ["4 2"], "Invalid input"],
                ["pub", 0.2, ["4 2", "1"], "Parametric solution"],
                ["pub", 0.2, ["1 2 3,2 4 6,3 6 9", "6 13 18"], "No solution"],
                ["pub", 0.2, ["4 5 -1,3 1 0,2 -2 2", "1 2"], "Incompatible size of matrices"],
                ["pub", 0.2, ["3 2 -5,2 -1 3,1 2 -1", "-1 13 9"], "[3, 5, 4]"],
                ["***", 0.2, ["3 2 -5,2 -1 3,4 -2 6", "-1 13 9"], "No solution"],
                ["***", 0.2, ["3 2 -5,2 -1 3,4 -2 6", "-1 13 26"], "Parametric solution"],
                ["***", 0.2, ["2 5 4 1,1 3 2 1,2 10 9 7,3 8 9 2", "20 11 40 37"], "[1, 2, 2, 0]"]],
            "histogram.py": [
                ["pub", 0.2, ["3,6,2,4,1,5", "6"], "[1, 1, 1, 1, 1, 1]"],
                ["pub", 0.2, ["3,6,2,4,1,5", "4"], "[2, 1, 1, 2]"],
                ["pub", 0.2, ["1,9,8,7,6,5,4", "3"], "[1, 3, 3]"],
                ["***", 0.2, ["3,3,3,3,3", "5"], "[5, 0, 0, 0, 0]"],
                ["***", 0.2, ["0,9,0,0,8,9,0", "2"], "[4, 3]"]],
            "loan.py": [
                ["pub", 0.2, ["100", "0.25", "2"], "[[51.57, 49.48, 2.08], [51.57, 50.52, 1.05]]"],
                ["pub", 0.2, ["100", "0.2", "4"], "[[26.05, 24.38, 1.67], [26.05, 24.79, 1.26], [26.05, 25.2, 0.85], [26.05, 25.62, 0.43]]"],
                ["pub", 0.2, ["1000", "0.1", "12"], "[[87.92, 79.58, 8.33], [87.92, 80.25, 7.67], [87.92, 80.91, 7.0], [87.92, 81.59, 6.33], [87.92, 82.27, 5.65], [87.92, 82.95, 4.96], [87.92, 83.65, 4.27], [87.92, 84.34, 3.57], [87.92, 85.05, 2.87], [87.92, 85.75, 2.16], [87.92, 86.47, 1.45], [87.92, 87.19, 0.73]]"],
                ["***", 0.2, ["50", "0.5", "5"], "[[11.28, 9.2, 2.08], [11.28, 9.58, 1.7], [11.28, 9.98, 1.3], [11.28, 10.4, 0.88], [11.28, 10.83, 0.45]]"],
                ["***", 0.2, ["80", "0.15", "6"], "[[13.92, 12.92, 1.0], [13.92, 13.08, 0.84], [13.92, 13.25, 0.67], [13.92, 13.41, 0.51], [13.92, 13.58, 0.34], [13.92, 13.75, 0.17]]"]],
            "magic.py": [
                ["pub", 0.2, ["3"], "[[2, 7, 6], [9, 5, 1], [4, 3, 8]]"],
                ["pub", 0.2, ["4"], "Invalid input"],
                ["pub", 0.2, ["5"], "[[3, 16, 9, 22, 15], [20, 8, 21, 14, 2], [7, 25, 13, 1, 19], [24, 12, 5, 18, 6], [11, 4, 17, 10, 23]]"],
                ["***", 0.2, ["6"], "Invalid input"],
                ["***", 0.2, ["7"], "[[4, 29, 12, 37, 20, 45, 28], [35, 11, 36, 19, 44, 27, 3], [10, 42, 18, 43, 26, 2, 34], [41, 17, 49, 25, 1, 33, 9], [16, 48, 24, 7, 32, 8, 40], [47, 23, 6, 31, 14, 39, 15], [22, 5, 30, 13, 38, 21, 46]]"]],
            "mprod.py": [
                ["pub", 0.2, [], "Invalid input"],
                ["pub", 0.2, ["1 2 3,4 5 6"], "[[1.0, 2.0, 3.0], [4.0, 5.0, 6.0]]"],
                ["pub", 0.2, ["1 2 3,4 5 6", "1 0,0 1"], "Incompatible size of matrices"],
                ["pub", 0.2, ["1 2 3,4 5 6", "1 0 0 1,0 1 0 2,0 0 1 3", "1 -1,1 -1,1 -1,1 -1"], "[[20.0, -20.0], [47.0, -47.0]]"],
                ["***", 0.2, ["3 -2 4,1 2 0", "3 1 3,5 6 3"], "Incompatible size of matrices"],
                ["***", 0.2, ["2 -1 1,3 4 2,0 2 1", "2 -1 1,3 4 2,0 2 1"], "[[1.0, -4.0, 1.0], [18.0, 17.0, 13.0], [6.0, 10.0, 5.0]]"]],
            "primesieve.py": [
                ["pub", 0.2, ["1"], "[]"],
                ["pub", 0.2, ["2"], "[2]"],
                ["pub", 0.2, ["10"], "[2, 3, 5, 7]"],
                ["pub", 0.2, ["50"], "[2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47]"],
                ["***", 0.2, ["22"], "[2, 3, 5, 7, 11, 13, 17, 19]"],
                ["***", 0.2, ["47"], "[2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47]"]],
            "rotate.py": [
                ["pub", 0.2, ["1,2,3,4,5", "0"], "[1, 2, 3, 4, 5]"],
                ["pub", 0.2, ["1,2,3,4,5", "2"], "[4, 5, 1, 2, 3]"],
                ["pub", 0.2, ["1,2,3,4,5", "-11"], "[2, 3, 4, 5, 1]"],
                ["***", 0.2, ["1,2,3,4,5", "101"], "[5, 1, 2, 3, 4]"],
                ["***", 0.2, ["1,2,3,4,5", "-77"], "[3, 4, 5, 1, 2]"]],
        },
        "filenames": ["anomaly.py", "gauss.py", "histogram.py", "loan.py", "magic.py", "mprod.py", "primesieve.py", "rotate.py"],
        "modules": ["sys"],
        "args": {}
    },
    "3": {
        "tests": {
            "dictsearch.py": [
                ["pub", 0.3, ["files/3/dict.txt", "virus"], "['virus', 'viruscidal', 'viruscide', 'virusemic', 'viruses', 'viruslike', 'virustatic']"],
                ["pub", 0.3, ["files/3/dict.txt", "vyrus"], "[]"],
                ["pub", 0.3, ["files/3/dict.txt", "skinch"], "['skinch']"],
                ["***", 0.3, ["files/3/dict.txt", "pyopneumope"], "['pyopneumopericardium', 'pyopneumoperitoneum', 'pyopneumoperitonitis']"],
                ["***", 0.3, ["files/3/dict.txt", "thermom"], "['thermomagnetic', 'thermomagnetically', 'thermomagnetism', 'thermometamorphic', 'thermometamorphism', 'thermometer', 'thermometerize', 'thermometers', 'thermometric', 'thermometrical', 'thermometrically', 'thermometrograph', 'thermometry', 'thermomigrate', 'thermomotive', 'thermomotor', 'thermomultiplier']"]],
            "findrects.py": [
                ["pub", 0.2, ["files/3/rects1.txt"], "0"],
                ["pub", 0.2, ["files/3/rects2.txt"], "7"],
                ["pub", 0.2, ["files/3/rects3.txt"], "9"],
                ["***", 0.2, ["files/3/rects4.txt"], "13"],
                ["***", 0.2, ["files/3/rects5.txt"], "1"]],
            "findsum.py": [
                ["pub", 0.2, ["files/3/sorted1.txt", "100"], "No answer"],
                ["pub", 0.2, ["files/3/sorted1.txt", "1118"], "[8, 9, 12, 15, 19, 30, 41, 53, 57, 59, 63, 64, 74, 79, 80, 83, 84, 93, 97, 98]"],
                ["pub", 0.2, ["files/3/sorted2.txt", "15000"], "[7494, 7506]"],
                ["***", 0.2, ["files/3/sorted3.txt", "12345"], "[1360, 1362, 1365, 1369, 1372, 1376, 1379, 1380, 1382]"],
                ["***", 0.2, ["files/3/sorted4.txt", "7777777"], "[388857, 388859, 388865, 388867, 388871, 388873, 388875, 388877, 388881, 388883, 388887, 388893, 388894, 388898, 388900, 388910, 388919, 388921, 388923, 388924]"]],
            "ifs.py": [
                ["pub", 3, ["files/3/fern.txt", "$USER$fern.png"], "files/3/fern.png"],
                ["pub", 3, ["files/3/sierpinsky.txt", "$USER$sierpinsky.png"], "files/3/sierpinsky.png"],
                ["pub", 3, ["files/3/carpet.txt", "$USER$carpet.png"], "files/3/carpet.png"],
                ["***", 3, ["files/3/maple.txt", "$USER$maple.png"], "files/3/maple.png"]],
            "rosewind.py": [
                ["pub", 3, ["files/3/minsk2025.csv", "$USER$minsk2025.png"], "files/3/minsk2025.png"],
                ["pub", 3, ["files/3/minsk2024.csv", "$USER$minsk2024.png"], "files/3/minsk2024.png"],
                ["***", 3, ["files/3/minsk2023.csv", "$USER$minsk2023.png"], "files/3/minsk2023.png"]],
            "selfavoid.py": [
                ["pub", 3, ["11", "$USER$selfavoid11.png"], "files/3/selfavoid11.png"],
                ["pub", 3, ["17", "$USER$selfavoid17.png"], "files/3/selfavoid17.png"],
                ["pub", 3, ["21", "$USER$selfavoid21.png"], "files/3/selfavoid21.png"],
                ["***", 3, ["30", "$USER$selfavoid30.png"], "files/3/selfavoid30.png"]],
            "sorting.py": [
                ["pub", 0.2, ["files/3/numbers1.txt", "bubble"], "(499500, 246138, [1, 2, 3, 6, 7, 8, 9, 10, 11, 13, 14, 15, 16, 17, 19, 23, 24, 25, 26, 30])"],
                ["pub", 0.2, ["files/3/numbers2.txt", "insertion", "15"], "(999, 0, [1, 2, 3, 6, 7, 8, 9, 10, 11, 13, 14, 15, 16, 17, 19])"],
                ["pub", 0.2, ["files/3/numbers3.txt", "selection", "20"], "(499500, 500, [1, 2, 3, 6, 7, 8, 9, 10, 11, 13, 14, 15, 16, 17, 19, 23, 24, 25, 26, 30])"],
                ["***", 1, ["files/3/numbers6.txt", "bubble", "19"], "(3123750, 0, [1, 3, 7, 12, 15, 20, 21, 23, 31, 37, 39, 41, 43, 51, 59, 70, 76, 78, 80])"],
                ["***", 1, ["files/3/numbers7.txt", "insertion", "23"], "(3123750, 3123750, [1, 3, 7, 12, 15, 20, 21, 23, 31, 37, 39, 41, 43, 51, 59, 70, 76, 78, 80, 86, 92, 97, 101])"],
                ["***", 1, ["files/3/numbers8.txt", "selection", "17"], "(3123750, 2491, [1, 3, 7, 12, 15, 20, 21, 23, 31, 37, 39, 41, 43, 51, 59, 70, 76])"]],
            "worldbank.py": [
                ["pub", 3, ["files/3/wb_life_exp.csv", "2023", "$USER$wb_life_exp_2023.png"], "files/3/wb_life_exp_2023.png"],
                ["pub", 3, ["files/3/wb_air_pollution.csv", "2020", "$USER$wb_air_pollution_2020.png"], "files/3/wb_air_pollution_2020.png"],
                ["pub", 3, ["files/3/wb_births.csv", "2023", "$USER$wb_births_2023.png"], "files/3/wb_births_2023.png"],
                ["***", 3, ["files/3/wb_life_exp.csv", "2022", "$USER$wb_life_exp_2022.png"], "files/3/wb_life_exp_2022.png"],
                ["***", 3, ["files/3/wb_births.csv", "2022", "$USER$wb_births_2022.png"], "files/3/wb_births_2022.png"]]
        },
        "filenames": ["dictsearch.py", "findrects.py", "findsum.py", "ifs.py", "rosewind.py", "selfavoid.py", "sorting.py", "worldbank.py"],
        "modules": ["sys", "math", "csv", "random", "matplotlib.pyplot"],
        "args": {"ifs.py": "sys.argv[2]", "rosewind.py": "sys.argv[2]", "selfavoid.py": "sys.argv[2]", "worldbank.py": "sys.argv[3]"}
    },
    "4": {
        "tests": {
            "hilbert.py": [
                ["pub", 2, ["3", "$USER$hilbert3.png"], "files/4/hilbert3.png"],
                ["pub", 2, ["5", "$USER$hilbert5.png"], "files/4/hilbert5.png"],
                ["pub", 2, ["9", "$USER$hilbert9.png"], "files/4/hilbert9.png"]],
            "mergelists.py": [
                ["pub", 1, ["files/4/srt1.txt", "files/4/srt2.txt"], "570000 [0, 2, 2, 2, 9, 9, 10, 10, 11, 11]"],
                ["pub", 1, ["files/4/srt3.txt", "files/4/srt4.txt"], "650000 [2, 5, 5, 5, 8, 14, 16, 17, 18, 18]"],
                ["***", 1, ["files/4/srt1.txt", "files/4/srt4.txt"], "660000 [0, 2, 5, 5, 9, 9, 10, 10, 11, 11]"]],
            "mergepostfix.py": [
                ["pub", 0.2, ["starlink hyperlink weblink"], "link"],
                ["pub", 0.2, ["starlink hyperlink weblink bing"], ""],
                ["***", 0.2, ["flout hideout stakeout hangout far-out ragout throughout foldout walkabout burnout"], "out"]],
            "mergesort.py": [
                ["pub", 3, ["files/4/numbers.txt"], "500000 [0, 0, 2, 3, 3, 6, 10, 11, 12, 12]"],
                ["***", 3, ["files/4/numbers2.txt"], "499999 [1, 1, 2, 9, 12, 13, 15, 17, 17, 23]"],
                ["***", 3, ["files/4/numbers3.txt"], "500001 [3, 5, 6, 7, 9, 9, 10, 10, 14, 17]"]],
            "permutations.py": [
                ["***", 0.2, ["a"], "1 ['a']"],
                ["pub", 0.2, ["abc"], "6 ['abc', 'acb', 'bac', 'bca', 'cab', 'cba']"],
                ["pub", 0.2, ["byte"], "24 ['bety', 'beyt', 'btey', 'btye', 'byet', 'byte', 'ebty', 'ebyt', 'etby', 'etyb', 'eybt', 'eytb', 'tbey', 'tbye', 'teby', 'teyb', 'tybe', 'tyeb', 'ybet', 'ybte', 'yebt', 'yetb', 'ytbe', 'yteb']"]],
            "power.py": [
                ["pub", 0.2, ["3", "15"], "14348907"],
                ["***", 0.2, ["123456789", "0"], "1"],
                ["pub", 0.2, ["289", "38"], "3266765984047762476113020857636095423501569427358254713188473809448582822334363925830408857281"]],
            "sorting.py": [
                ["pub", 2, ["files/4/integers.txt", "bubble", "5000", "10"], "[582, 983, 1078, 1315, 1374, 1584, 2197, 2327, 2499, 2659]"],
                ["pub", 1, ["files/4/integers.txt", "selection", "5000", "10"], "[582, 983, 1078, 1315, 1374, 1584, 2197, 2327, 2499, 2659]"],
                ["pub", 1, ["files/4/integers.txt", "insertion", "5000", "10"], "[582, 983, 1078, 1315, 1374, 1584, 2197, 2327, 2499, 2659]"],
                ["pub", 0.5, ["files/4/integers.txt", "quick", "50000", "10"], "[57, 77, 90, 94, 111, 149, 150, 182, 242, 262]"],
                ["pub", 0.5, ["files/4/integers.txt", "merge", "50000", "10"], "[57, 77, 90, 94, 111, 149, 150, 182, 242, 262]"]],
            "spiralmatrix.py": [
                ["pub", 0.2, ["4"], "[[16, 15, 14, 13], [5, 4, 3, 12], [6, 1, 2, 11], [7, 8, 9, 10]]"],
                ["pub", 0.2, ["7"], "[[37, 36, 35, 34, 33, 32, 31], [38, 17, 16, 15, 14, 13, 30], [39, 18, 5, 4, 3, 12, 29], [40, 19, 6, 1, 2, 11, 28], [41, 20, 7, 8, 9, 10, 27], [42, 21, 22, 23, 24, 25, 26], [43, 44, 45, 46, 47, 48, 49]]"],
                ["***", 0.2, ["8"], "[[64, 63, 62, 61, 60, 59, 58, 57], [37, 36, 35, 34, 33, 32, 31, 56], [38, 17, 16, 15, 14, 13, 30, 55], [39, 18, 5, 4, 3, 12, 29, 54], [40, 19, 6, 1, 2, 11, 28, 53], [41, 20, 7, 8, 9, 10, 27, 52], [42, 21, 22, 23, 24, 25, 26, 51], [43, 44, 45, 46, 47, 48, 49, 50]]"]],
            "strassen.py": [
                ["pub", 0.2, ["files/4/a4.txt", "files/4/b4.txt"], "23327343893419"],
                ["***", 1, ["files/4/b100.txt", "files/4/a100.txt"], "6290156692727046808"],
                ["pub", 2, ["files/4/a256.txt", "files/4/b256.txt"], "264888502496649753568"]],
            "targetsum.py": [
                ["pub", 3, ["1000"], "5 ['1*2+345-67+8*90', '1*23*4+5+6+7+890', '1*23+4*5+67+890', '1*23+45+6*7+890', '1+2-3+45*6*7-890']"],
                ["pub", 3, ["-901"], "8 ['1*2+34-5-6*7-890', '1*2-3*45-678-90', '1*2-3-4-5+6-7-890', '1*2-34*5-6-7-8*90', '1*2-345-6*78-90', '1-2-3-4*5+6+7-890', '12*3+4*5-67-890', '12*3-4*56+7-8*90']"],
                ["***", 3, ["1795"], "1 ['1+2*3*4+5*6*7*8+90']"]],
            "walkdirectory.py": [
                ["pub", 0.2, ["files/4/books"], "15 [('5.38 MB', 'en/british/Shakespeare. The Complete Works.txt'), ('3.20 MB', 'ru/Tolstoy. War and Peace.txt'), ('1.51 MB', 'en/british/irish/Joyce. Ulysses.txt'), ('1.22 MB', 'en/Melville. Moby Dick.txt'), ('1.20 MB', 'en/british/Hobbes. Leviathan.txt')]"],
                ["pub", 0.2, ["files/4/books2"], "6 [('869.53 KB', '1/2/3/4/5/6/7/Stoker. Dracula.txt'), ('641.38 KB', '1/2/3/4/5/6/Alighieri. The Divine Comedy.txt'), ('454.94 KB', '1/2/3/4/Wilde. The Picture of Dorian Gray.txt'), ('300.84 KB', '1/2/3/4/5/6/Machiavelli. The Prince.txt'), ('170.27 KB', \"1/Carroll. Alice\'s Adventures in Wonderland.txt\")]"],
                ["***", 0.2, ["files/4/books3"], "4 [('1.19 MB', '2/4/5/Plato. The Republic.txt'), ('641.38 KB', '3/Alighieri. The Divine Comedy.txt'), ('438.41 KB', '1/3/4/5/Shelley. Frankenstein.txt'), ('138.72 KB', '2/3/4/Kafka. Metamorphosis.txt')]"]]
        },
        "filenames": ["hilbert.py", "mergelists.py", "mergepostfix.py", "mergesort.py", "permutations.py", "power.py", "sorting.py", "spiralmatrix.py", "strassen.py", "targetsum.py", "walkdirectory.py"],
        "modules": ["sys", "os", "matplotlib.pyplot"],
        "args": {"hilbert.py": "sys.argv[2]"}
    },
    "5": {
        "tests": {
            "checkbrackets.py": [
                ["pub", 0.2, ["([{}()])([][])"], "True"],
                ["pub", 0.2, ["([{}()])([[][])"], "False"],
                ["***", 0.2, ["([{{[[(())]]}}({[]})]([{}({[()]})])([{}[)])])"], "False"]],
            "checkout.py": [
                ["pub", 0.5, ["files/5/customers1.txt", "4"], "[[4, 4, 1.0], [4, 4, 1.0], [4, 4, 1.0], [4, 4, 1.0]]"],
                ["pub", 0.5, ["files/5/customers2.txt", "3"], "[[4, 11, 2.75], [5, 11, 2.2], [8, 18, 2.25], [6, 15, 2.5], [5, 12, 2.4], [3, 9, 3.0], [3, 6, 2.0], [2, 3, 1.5], [1, 1, 1.0]]"],
                ["***", 0.5, ["files/5/customers3.txt", "7"], "[[4, 10, 2.5], [4, 7, 1.75], [5, 21, 4.2], [5, 17, 3.4], [7, 30, 4.29], [8, 24, 3.0], [10, 20, 2.0], [8, 13, 1.62], [5, 6, 1.2], [1, 1, 1.0]]"]],
            "drunkgame.py": [
                ["pub", 0.2, ["3 2 2 1 4 3 1 4"], "[['3 2 2 1', '4 3 1 4'], ['2 2 1', '3 1 4 4 3'], ['2 1', '1 4 4 3 3 2'], ['1 2 1', '4 4 3 3 2'], ['2 1', '4 3 3 2 4 1'], ['1', '3 3 2 4 1 4 2'], ['', '3 2 4 1 4 2 3 1']]"],
                ["pub", 0.2, ["1 5 4 3 2 5 2 4 3 1"], "[['1 5 4 3 2', '5 2 4 3 1'], ['5 4 3 2', '2 4 3 1 5 1'], ['4 3 2 5 2', '4 3 1 5 1'], ['5 2 4 4 3 3 2 1', '5 1'], ['4 4 3 3 2 1 5 5 2 1', '']]"],
                ["***", 0.2, ["5 4 3 2 4 2 1 8"], "[['5 4 3 2', '4 2 1 8'], ['4 3 2 5 4', '2 1 8'], ['3 2 5 4 4 2', '1 8'], ['2 5 4 4 2 3 1', '8'], ['5 4 4 2 3 1', '8 2'], ['4 4 2 3 1', '2 8 5'], ['4 2 3 1 4 2', '8 5'], ['2 3 1 4 2', '5 8 4'], ['3 1 4 2', '8 4 5 2'], ['1 4 2', '4 5 2 8 3'], ['4 2', '5 2 8 3 4 1'], ['2', '2 8 3 4 1 5 4'], ['', '8 3 4 1 5 4 2 2']]"]],
            "heapsort.py": [
                ["pub", 0.5, ["files/5/numbers.txt", "10000", "10"], "[999894, 999891, 999779, 999709, 999397, 999249, 999033, 998993, 998956, 998887]"],
                ["pub", 1, ["files/5/numbers.txt", "50000", "10"], "[999938, 999936, 999935, 999909, 999894, 999892, 999891, 999868, 999835, 999820]"],
                ["***", 1, ["files/5/numbers.txt", "50000", "20"], "[999938, 999936, 999935, 999909, 999894, 999892, 999891, 999868, 999835, 999820, 999816, 999805, 999794, 999779, 999709, 999691, 999681, 999657, 999652, 999615]"]],
            "infixcalc.py": [
                ["pub", 0.2, ["( 3 + 9 ) / 2 * 5 - ( 15 - 10 ) / 5"], "29.0"],
                ["pub", 0.2, ["( 2 + 3 ) / ( 2 - 2 )"], "Division by zero"],
                ["***", 0.2, ["( 4 - 1 ) / ( 5 - 2"], "Invalid input"]],
            "minheap.py": [
                ["pub", 0.2, [""], "[3, 5, 4, 6, 9, 6]"],
                ["pub", 0.2, [""], "[3, 5, 4, 6, 9, 6]"],
                ["pub", 0.2, [""], "[3, 5, 4, 6, 9, 6]"]],
            "postfixcalc.py": [
                ["pub", 2, ["3 9 + 2 / 5 * 15 10 - 5 / -"], "29.0"],
                ["pub", 1, ["3 9 + +"], "Invalid input"],
                ["pub", 1, ["2 3 + 4 4 - /"], "Division by zero"]],
            "simplestack.py": [
                ["pub", 0.2, [""], "deque([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])"],
                ["pub", 0.2, [""], "deque([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])"],
                ["pub", 0.2, [""], "deque([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])"]],
            "tasks.py": [
                ["pub", 2, ["1,1,3,2,1", "2", "$USER$tasks1.png"], "files/5/tasks1.png"],
                ["pub", 2, ["1,1,3,2,1", "3", "$USER$tasks2.png"], "files/5/tasks2.png"],
                ["***", 2, ["3,4,2,2,1,4,3,1,1,4,2,3,5,4,2,2,3,1", "4", "$USER$tasks3.png"], "files/5/tasks3.png"]],
            "undo.py": [
                ["pub", 0.2, ["files/5/log1.txt"], "no pain no gain"],
                ["pub", 0.2, ["files/5/log3.txt"], ""],
                ["***", 0.2, ["files/5/log2.txt"], "live and earn"]]
        },
        "filenames": ["checkbrackets.py", "checkout.py", "drunkgame.py", "heapsort.py", "infixcalc.py", "minheap.py", "postfixcalc.py", "simplestack.py", "tasks.py", "undo.py"],
        "modules": ["sys", "collections", "simplestack", "postfixcalc", "simplequeue", "minheap", "heapq", "matplotlib.pyplot", "matplotlib.patches"],
        "args": {"tasks.py": "sys.argv[3]"}
    },
    "6": {
        "tests": {
            "actorsdist.py": [
                ["pub", 0.2, ["files/6/actors.tsv", "Kevin Bacon", "Tom Hanks"], "[1, ['Apollo 13']]"],
                ["pub", 0.2, ["files/6/actors.tsv", "Kevin Bacon", "Tom Hardy"], "[3, ['Apollo 13', 'Catch Me If You Can', 'Inception']]"],
                ["***", 0.2, ["files/6/actors.tsv", "Will Smith", "Anna Lee"], "[4, ['Shark Tale', 'Meet the Fockers', 'Funny Girl', 'How Green Was My Valley']]"]],
            "bellman.py": [
                ["pub", 1, ["files/6/belarus.tsv", "Минск", "108"], "[('Жодино', 57), ('Горка', 61), ('Червень', 63), ('Плещеницы', 69), ('Узда', 70), ('Воложин', 74), ('Молодечно', 76), ('Столбцы', 76), ('Борисов', 77), ('Вилейка', 98), ('Слуцк', 99), ('Березино', 106), ('Бегомль', 108)]"],
                ["pub", 1, ["files/6/belarus.tsv", "Малорита"], "[('Брест', 53), ('Высокое', 93), ('Кобрин', 99), ('Пружаны', 150), ('Ивацевичи', 188), ('Ружаны', 194), ('Слоним', 230), ('Пинск', 234), ('Волковыск', 242), ('Барановичи', 259), ('Дятлово', 277), ('Ганцевичи', 298), ('Лунинец', 298), ('Столин', 298), ('Щучин', 298), ('Несвиж', 301), ('Новогрудок', 314), ('Лида', 319), ('Гродно', 320), ('Столбцы', 320), ('Слуцк', 341), ('Вороново', 352), ('Микошевичи', 353), ('Узда', 365), ('Солигорск', 368), ('Житковичи', 389), ('Минск', 396), ('Воложин', 402), ('Любань', 411), ('Ошмяны', 418), ('Горка', 428), ('Молодечно', 443), ('Осиповичи', 448), ('Сморгонь', 452), ('Жодино', 453), ('Бобруйск', 457), ('Червень', 459), ('Вилейка', 465), ('Плещеницы', 465), ('Борисов', 473), ('Октябрьский', 495), ('Паричи', 501), ('Березино', 502), ('Бегомль', 504), ('Калинковичи', 505), ('Мядель', 511), ('Рогачев', 516), ('Мозырь', 517), ('Жлобин', 520), ('Светлогорск', 530), ('Докшицы', 532), ('Наровля', 544), ('Довск', 545), ('Поставы', 547), ('Ельск', 551), ('Лепель', 553), ('Белыничи', 555), ('Толочин', 557), ('Глубокое', 562), ('Хойники', 567), ('Могилев', 571), ('Речица', 586), ('Брагин', 591), ('Славгород', 593), ('Лельчицы', 595), ('Орша', 604), ('Чечерск', 605), ('Чаусы', 613), ('Гомель', 614), ('Чериков', 623), ('Полоцк', 625), ('Браслав', 630), ('Шклов', 633), ('Добруш', 640), ('Комарин', 647), ('Горки', 650), ('Кричев', 650), ('Витебск', 665), ('Мстиславль', 670), ('Россоны', 672), ('Миоры', 674), ('Костюковичи', 680), ('Городок', 701), ('Лиозно', 709)]"],
                ["***", 1, ["files/6/belarus.tsv", "Гродно", "267"], "[('Щучин', 63), ('Волковыск', 78), ('Лида', 112), ('Ружаны', 126), ('Слоним', 137), ('Вороново', 145), ('Дятлово', 154), ('Ивацевичи', 165), ('Новогрудок', 168), ('Пружаны', 170), ('Барановичи', 194), ('Воложин', 204), ('Ошмяны', 220), ('Кобрин', 221), ('Несвиж', 236), ('Молодечно', 245), ('Столбцы', 246), ('Сморгонь', 254), ('Ганцевичи', 263), ('Пинск', 266), ('Брест', 267), ('Вилейка', 267)]"]],
            "bfs.py": [
                ["pub", 0.5, ["files/6/tree1.tsv", "1"], "['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25']"],
                ["pub", 0.5, ["files/6/tree2.tsv", "3"], "['3', '1', '7', '8', '9', '2', '4', '16', '17', '18', '19', '20', '5', '6', '10', '11', '27', '12', '13', '14', '15', '21', '22', '23', '24', '25', '26']"],
                ["***", 0.5, ["files/6/tree3.tsv", "7"], "['7', '2', '18', '19', '1', '5', '6', '40', '41', '42', '43', '3', '4', '14', '15', '16', '17', '8', '9', '10', '11', '12', '13', '32', '33', '34', '35', '36', '37', '38', '39', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30', '31', '44', '45', '46', '47', '48', '49', '50', '51', '52', '53', '54', '55', '56', '57', '58', '59', '60']"]],
            "dfs.py": [
                ["pub", 0.2, ["files/6/tree1.tsv", "1"], "['1', '2', '5', '12', '22', '13', '23', '6', '14', '15', '24', '3', '7', '16', '8', '17', '25', '9', '18', '4', '10', '19', '20', '11', '21']"],
                ["pub", 0.2, ["files/6/tree2.tsv", "3"], "['3', '1', '2', '5', '12', '23', '13', '24', '6', '14', '25', '15', '26', '4', '10', '21', '11', '22', '7', '16', '27', '17', '8', '18', '19', '9', '20']"],
                ["***", 0.2, ["files/6/tree3.tsv", "7"], "['7', '2', '1', '3', '8', '20', '44', '45', '21', '46', '47', '9', '22', '48', '49', '23', '50', '51', '10', '24', '52', '53', '25', '54', '55', '4', '11', '26', '56', '57', '27', '58', '59', '12', '28', '60', '29', '13', '30', '31', '5', '14', '32', '33', '15', '34', '35', '6', '16', '36', '37', '17', '38', '39', '18', '40', '41', '19', '42', '43']"]],
            "dijkstra.py": [
                ["pub", 1, ["files/6/belarus.tsv", "Минск", "108"], "[('Жодино', 57), ('Горка', 61), ('Червень', 63), ('Плещеницы', 69), ('Узда', 70), ('Воложин', 74), ('Молодечно', 76), ('Столбцы', 76), ('Борисов', 77), ('Вилейка', 98), ('Слуцк', 99), ('Березино', 106), ('Бегомль', 108)]"],
                ["pub", 1, ["files/6/belarus.tsv", "Малорита"], "[('Брест', 53), ('Высокое', 93), ('Кобрин', 99), ('Пружаны', 150), ('Ивацевичи', 188), ('Ружаны', 194), ('Слоним', 230), ('Пинск', 234), ('Волковыск', 242), ('Барановичи', 259), ('Дятлово', 277), ('Ганцевичи', 298), ('Лунинец', 298), ('Столин', 298), ('Щучин', 298), ('Несвиж', 301), ('Новогрудок', 314), ('Лида', 319), ('Гродно', 320), ('Столбцы', 320), ('Слуцк', 341), ('Вороново', 352), ('Микошевичи', 353), ('Узда', 365), ('Солигорск', 368), ('Житковичи', 389), ('Минск', 396), ('Воложин', 402), ('Любань', 411), ('Ошмяны', 418), ('Горка', 428), ('Молодечно', 443), ('Осиповичи', 448), ('Сморгонь', 452), ('Жодино', 453), ('Бобруйск', 457), ('Червень', 459), ('Вилейка', 465), ('Плещеницы', 465), ('Борисов', 473), ('Октябрьский', 495), ('Паричи', 501), ('Березино', 502), ('Бегомль', 504), ('Калинковичи', 505), ('Мядель', 511), ('Рогачев', 516), ('Мозырь', 517), ('Жлобин', 520), ('Светлогорск', 530), ('Докшицы', 532), ('Наровля', 544), ('Довск', 545), ('Поставы', 547), ('Ельск', 551), ('Лепель', 553), ('Белыничи', 555), ('Толочин', 557), ('Глубокое', 562), ('Хойники', 567), ('Могилев', 571), ('Речица', 586), ('Брагин', 591), ('Славгород', 593), ('Лельчицы', 595), ('Орша', 604), ('Чечерск', 605), ('Чаусы', 613), ('Гомель', 614), ('Чериков', 623), ('Полоцк', 625), ('Браслав', 630), ('Шклов', 633), ('Добруш', 640), ('Комарин', 647), ('Горки', 650), ('Кричев', 650), ('Витебск', 665), ('Мстиславль', 670), ('Россоны', 672), ('Миоры', 674), ('Костюковичи', 680), ('Городок', 701), ('Лиозно', 709)]"],
                ["***", 1, ["files/6/belarus.tsv", "Гродно", "267"], "[('Щучин', 63), ('Волковыск', 78), ('Лида', 112), ('Ружаны', 126), ('Слоним', 137), ('Вороново', 145), ('Дятлово', 154), ('Ивацевичи', 165), ('Новогрудок', 168), ('Пружаны', 170), ('Барановичи', 194), ('Воложин', 204), ('Ошмяны', 220), ('Кобрин', 221), ('Несвиж', 236), ('Молодечно', 245), ('Столбцы', 246), ('Сморгонь', 254), ('Ганцевичи', 263), ('Пинск', 266), ('Брест', 267), ('Вилейка', 267)]"]],
            "findarea.py": [
                ["pub", 0.2, ["files/6/figure1.txt"], "16"],
                ["pub", 0.2, ["files/6/figure2.txt"], "Error"],
                ["***", 0.2, ["files/6/figure3.txt"], "14"]],
            "mode.py": [
                ["pub", 0.2, ["files/6/visits10k.txt"], "[['duckduckgo.com', 364], ['openai.com', 364]]"],
                ["pub", 0.2, ["files/6/visits100k.txt"], "[['vk.com', 3347]]"],
                ["***", 0.2, ["files/6/visits1m.txt"], "[['pinterest.com', 32581]]"]],
            "pathfinder.py": [
                ["pub", 1, ["files/6/maze2.txt", "1,1", "5,1", "$USER$maze2.png"], "files/6/maze2.png"],
                ["***", 1, ["files/6/maze1.txt", "1,1", "17,59", "$USER$maze1.png"], "files/6/maze1.png"]],
            "stairs.py": [
                ["pub", 1, ["10"], "274"],
                ["pub", 1, ["100"], "180396380815100901214157639"],
                ["***", 1, ["500"], "1306186569702186634983475450062372018715120191391192207156664343051610913971927959744519676992404852130396504615663042713312314219527"]],
            "sudokucheck.py": [
                ["pub", 0.2, ["files/6/sudoku1.txt"], "True"],
                ["pub", 0.2, ["files/6/sudoku2.txt"], "True"],
                ["pub", 0.2, ["files/6/sudoku3.txt"], "False"]],
            "toposorting.py": [
                ["pub", 1, ["files/6/graph1.tsv"], "['10', '9', '8', '3', '2', '11', '5', '7', '12', '4', '6', '1', '14', '13']"],
                ["pub", 1, ["files/6/graph2.tsv"], "['12', '11', '10', '9', '8', '7', '6', '5', '4', '3', '2', '1']"],
                ["***", 1, ["files/6/graph3.tsv"], "['8', '9', '4', '10', '5', '2', '11', '6', '12', '13', '7', '3', '1]"]],
            "wordfinder.py": [
                ["pub", 0.2, ["files/6/ru.txt", "питон"], "['ион', 'опт', 'пот', 'тип', 'тон', 'топ', 'пион', 'пони', 'питон']"],
                ["pub", 0.2, ["files/6/ru.txt", "анаконда", "6"], "['анаконда', 'канонада']"],
                ["***", 0.2, ["files/6/ru.txt", "гидроэнергоресурс", "7"], "['георгин', 'горение', 'гудение', 'негроид', 'недосуг', 'осердие', 'регресс', 'ригодон', 'синерод', 'снегоед', 'угодное', 'усердие', 'единорог', 'одурение', 'усоногие']"]]
        },
        "filenames": ["actorsdist.py", "bfs.py", "dfs.py", "dijkstra.py", "findarea.py", "mode.py", "stairs.py", "sudokucheck.py", "toposorting.py", "wordfinder.py"],
        "modules": ["sys", "collections", "minheap", "heapq", "matplotlib.pyplot", "matplotlib.patches"],
        "args": {"pathfinder.py": "sys.argv[4]"}
    },
    "7": {
        "tests": {
            "coinchange.py": [
                ["pub", 0.2, ["1,5,7", "12"], "(['greedy', 2, [7, 5]], ['dp', 2, [7, 5]])"],
                ["pub", 0.2, ["2,6,7", "8"], "(['greedy', inf, []], ['dp', 2, [6, 2]])"],
                ["pub", 0.2, ["1,7,9", "23"], "(['greedy', 7, [9, 9, 1, 1, 1, 1, 1]], ['dp', 3, [9, 7, 7]])"]],
            "knapsack.py": [
                ["pub", 1, ["files/7/items.tsv", "100", "50"], "(['greedy', 5646], ['topdown', 5646], ['bottomup', 5646])"],
                ["***", 1, ["files/7/items.tsv", "200", "200"], "(['greedy', 13419], ['topdown', 13607], ['bottomup', 13607])"],
                ["pub", 6, ["files/7/items.tsv", "5000", "500"], "(['greedy', 117451], ['topdown', 117482], ['bottomup', 117482])"]],
            "knapsackitems.py": [
                ["pub", 1, ["files/7/items.tsv", "100", "50"], "(['greedy', 5646, [(214, 3), (268, 13), (367, 1), (460, 10), (465, 9), (514, 14), (718, 1), (768, 20), (875, 18), (997, 11)]], ['topdown', 5646, [(214, 3), (268, 13), (367, 1), (460, 10), (465, 9), (514, 14), (718, 1), (768, 20), (875, 18), (997, 11)]], ['bottomup', 5646, [(214, 3), (268, 13), (367, 1), (460, 10), (465, 9), (514, 14), (718, 1), (768, 20), (875, 18), (997, 11)]])"],
                ["***", 1, ["files/7/items.tsv", "500", "100"], "(['greedy', 17661, [(213, 17), (214, 3), (216, 8), (268, 13), (363, 19), (367, 1), (460, 10), (465, 9), (514, 14), (537, 30), (580, 15), (659, 8), (663, 15), (673, 34), (718, 1), (720, 9), (729, 25), (734, 27), (740, 23), (768, 20), (785, 27), (796, 35), (805, 28), (875, 18), (886, 28), (921, 5), (995, 42), (997, 11)]], ['topdown', 17707, [(214, 3), (216, 8), (268, 13), (367, 1), (460, 10), (465, 9), (514, 14), (537, 30), (580, 15), (622, 37), (659, 8), (663, 15), (673, 34), (718, 1), (720, 9), (729, 25), (734, 27), (740, 23), (768, 20), (785, 27), (796, 35), (805, 28), (875, 18), (886, 28), (921, 5), (995, 42), (997, 11)]], ['bottomup', 17707, [(214, 3), (216, 8), (268, 13), (367, 1), (460, 10), (465, 9), (514, 14), (537, 30), (580, 15), (622, 37), (659, 8), (663, 15), (673, 34), (718, 1), (720, 9), (729, 25), (734, 27), (740, 23), (768, 20), (785, 27), (796, 35), (805, 28), (875, 18), (886, 28), (921, 5), (995, 42), (997, 11)]])"],
                ["pub", 1, ["files/7/items.tsv", "20", "500"], "(['greedy', 7431, [(364, 1), (367, 1), (412, 1), (445, 2), (548, 3), (575, 1), (591, 1), (718, 1), (762, 1), (837, 2), (854, 2), (958, 3)]], ['topdown', 7520, [(364, 1), (367, 1), (412, 1), (534, 3), (548, 3), (575, 1), (591, 1), (718, 1), (762, 1), (837, 2), (854, 2), (958, 3)]], ['bottomup', 7520, [(364, 1), (367, 1), (412, 1), (534, 3), (548, 3), (575, 1), (591, 1), (718, 1), (762, 1), (837, 2), (854, 2), (958, 3)]])"]],
            "maze.py": [
                ["pub", 3, ["31", "15", "$USER$maze1.png"], "files/7/maze1.png"],
                ["pub", 3, ["19", "19", "$USER$maze2.png"], "files/7/maze2.png"],
                ["***", 3, ["51", "25", "$USER$maze3.png"], "files/7/maze3.png"]],
            "mst.py": [
                ["pub", 0.2, ["files/7/belarus.tsv"], "3858"],
                ["pub", 1, ["files/7/graph1k.tsv"], "1254"],
                ["***", 0.2, ["files/7/graph.tsv"], "4"]],
            "nqueens.py": [
                ["pub", 0.2, ["5"], "10 [[0, 2, 4, 1, 3], [0, 3, 1, 4, 2], [1, 3, 0, 2, 4], [1, 4, 2, 0, 3], [2, 0, 3, 1, 4], [2, 4, 1, 3, 0], [3, 0, 2, 4, 1], [3, 1, 4, 2, 0], [4, 1, 3, 0, 2], [4, 2, 0, 3, 1]]"],
                ["pub", 1, ["11", "False"], "2680"],
                ["***", 0.2, ["8", "False"], "92"]],
            "pathfinder2.py": [
                ["pub", 4, ["files/7/maze1.txt", "1,1", "1,59", "$USER$pathfinder1.png"], "files/7/pathfinder1.png"],
                ["pub", 4, ["files/7/maze1.txt", "1,1", "19,1", "$USER$pathfinder2.png"], "files/7/pathfinder2.png"],
                ["pub", 4, ["files/7/maze1.txt", "1,1", "19,42", "$USER$pathfinder3.png"], "files/7/pathfinder3.png"]],
            "sudoku.py": [
                ["pub", 1, ["files/7/sudoku1.txt"], "1 решение, задача будет проверяться вручную"],
                ["pub", 1, ["files/7/sudoku2.txt"], "1 решение, задача будет проверяться вручную"],
                ["pub", 7, ["files/7/sudoku3.txt"], "63 решения, задача будет проверяться вручную"]],
            "tasks.py": [
                ["pub", 0.2, ["1,2 2,6 2,3 4,6"], "3 [(1, 2), (2, 3), (4, 6)]"],
                ["pub", 0.2, ["1,15 10,13 9,12 3,8 1,2 6,9 14,15"], "4 [(1, 2), (3, 8), (9, 12), (14, 15)]"],
                ["***", 0.2, ["1,10 2,3 3,4 4,5 5,6 6,7 7,8 8,9 9,10"], "8 [(2, 3), (3, 4), (4, 5), (5, 6), (6, 7), (7, 8), (8, 9), (9, 10)]"]],
            "wordswithin.py": [
                ["pub", 1, ["files/7/ru.txt", "лампа"], "13 ['лампа', 'лампас', 'лампада', 'лампасы', 'лампадка', 'ламповая', 'лампочка', 'фотолампа', 'лампадочка', 'ламповщица', 'радиолампа', 'электролампа', 'электролампочка']"],
                ["pub", 1, ["files/7/ru.txt", "ееееее"], "2 ['переобременение', 'перераспределение']"],
                ["***", 1, ["files/7/ru.txt", "ложка"], "22 ['ложка', 'лодыжка', 'ложечка', 'ложкарь', 'обложка', 'ложбинка', 'подложка', 'таволожка', 'долгоножка', 'клещеножка', 'ложбиночка', 'ложкомойка', 'ложноножка', 'плодожорка', 'плодоножка', 'сладкоежка', 'сластоежка', 'слобожанка', 'малолитражка', 'суперобложка', 'ложноклассицизм', 'политкаторжанка']"]]
        },
        "filenames": ["coinchange.py", "knapsack.py", "knapsackitems.py", "maze.py", "mst.py", "nqueens.py", "pathfinder2.py", "sudoku.py", "tasks.py", "wordswithin.py"],
        "modules": ["sys", "random", "collections", "matplotlib.pyplot", "matplotlib.patches", "functools"],
        "args": {"maze.py": "sys.argv[3]", "pathfinder2.py": "sys.argv[4]"}
    }
}